{"meta":{"title":"Talk is cheap, show me the code!","subtitle":"","description":"","author":"John Smith","url":"http://yoursite.com","root":"/"},"pages":[{"title":"About author","date":"2020-08-30T19:12:54.845Z","updated":"2020-08-30T19:12:54.845Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"A code monkey who loves life and travelling."}],"posts":[{"title":"东京 • 春","slug":"tokyo-2019-04","date":"2020-08-30T00:56:24.000Z","updated":"2020-09-07T07:20:06.862Z","comments":true,"path":"2020/08/29/tokyo-2019-04/","link":"","permalink":"http://yoursite.com/2020/08/29/tokyo-2019-04/","excerpt":"","text":"东京抵达东京早在很久之前，我们就有去东京旅行的想法。挑在这个时间去旅行，一是有清明假期，可以省下几天年假；二是春天是看樱花的好时节；三是庆祝恋爱四周年，也算是一次迟来的毕业旅行。我们在东京时间晚上九点左右抵达羽田机场，乘坐地铁来到位于银座的酒店。第一次在东京坐地铁还遇到了一些小波折。因为到得太晚，办理西瓜卡或Pasmo卡的地方已经下班，只能单独购票。东京地铁在不同段若由不同的公司管理，则在Google map上会显示为不同名称的线路，导致我们为是否需要换乘而迷惑了一会儿，而事实上如果没有特别说明需要换乘，那么就算线路名称有改变，也是不需要下车换乘的。 最后好歹到达了银座站，在路上遇到一家FamilyMart，抱着试一试的心态买了一罐男梅酒，可惜我们俩对这个酒的味道都有点接受无能。 第一日 走断腿上野公园 &amp; 上野动物园上野公园里的樱花树都非常高大，于我而言少了些美感。树下的草地上有很多野炊的人，每一拨人都带着一大块野餐布，中间放满食物，大家围坐在一起有说有笑。野餐布一块接一块紧密地排列在一起，好似舍不得浪费任何一寸可利用的土地。就是在这样紧密的排布下，野炊的人竟也几乎把空地占满了。我不禁好奇究竟这些人是在参加公司的团建活动，还是日本确实很流行野炊。 离上野公园不远是上野动物园和国立科学博物馆，我们去这两处转了转。上野动物园里最壮观的场面当属排队看大熊猫的队伍，弯弯绕绕不知排了多少人，和其他动物场馆形成鲜明的对比。 中午，我们在上野公园附近的一家罗森便利店买了些吃的，带到。这家罗森的炸鸡味道非常好，后来在其他便利店再没有遇到这么好吃的炸鸡。 浅草寺下午去往浅草寺。浅草寺的游人更多，说是摩肩接踵也毫不为过。寺前的街道上有很多小店，我被其间的风铃所吸引，但是游人实在太多，便打消了上去凑热闹的念头。遗憾的是，由于我们上午在上野消耗了太多体力，下午只能走走停停。后来看我住知道浅草寺有一家画搞笑人像的店，下次有机会再去看看。 银座夜景由于白天打卡一样的逛了好几个景点，回到酒店已经要累趴了。稍作休整后决定就在酒店附近的银座看看夜景。 第二日 圣地巡礼新宿御苑不管是赏樱还是圣地巡礼，不可不去的就是凭借新海诚的言叶之庭而为大家所知的新宿御苑了，也是这次东京之行最为期待的去处之一了。凉亭确实没有动画里的那种美感，可能游人太多，以及没有下雨的缘故吧，不过新宿御苑确实是赏樱的绝佳去处，倒映在水上的樱花树和漂浮在水面的花瓣给人无限的遐想，似乎已然进入梦境之中 涩谷涩谷离新宿很近，还有世界知名的繁华的十字路口，自然得前去看看。 Tokyo Tower 第三日 拜访谷歌东京谷歌东京很早就听说坐落在六本木之丘的谷歌东京office非常漂亮，于是早早和在谷歌东京的两位学长联系，希望带我们参观一下office。六本木之丘之前是铁铸的大蜘蛛，倒是很有特征，找起来也很方便。office的伙食极具日本特色，比如烤鳗鱼、荞麦面等，吃起来也很不错，和北京一样吊打MTV总部的垃圾食堂。吃完饭以后Byvoid学长带我们到属于谷歌的最高层俯瞰位于涩谷的新office。据说天气好的时候甚至可以远瞰到富士山，可惜当天有点多云。 美丽的横滨离开谷歌后，我们决定去横滨看看海景以及中华街。不得不说横滨真是一个美丽的城市，当我看到那一团团的花丛衬托着近处的喷泉以及远处的海景，我甚至有被震撼到，不由自主停下来坐在长椅上感受了一下这番美丽。如果以后我在东京工作，也许我会住在横滨吧，毕竟地铁过来还是挺方便的。至于中华街反倒没有给我留下特别深的印象，也许看着日本人卖中华特产就和美国人到中国看到加州牛肉面大王一般无奈。 中目黑赏樱从横滨回来后我们决定顺道去中目黑看看夜樱，结果一出地铁看到的确实黑压压的人群，让我仿佛想起了N年前国庆在南京挤不上火车的那个夜晚。好在中目黑的樱花确实别有一番风采，不过拍了两张照片我们就撤了，因为人群实在太拥挤了。 第四日 Ghibli!三鹰之森吉卜力博物馆位于三鹰市的吉卜力博物馆绝对是此次日本之行的重中之重。作为铁杆粉丝，久仰博物馆大名，于是很早就做了攻略，提前一个多月订了门票。博物馆不在东京十三区，需要转几次地铁再坐博物馆的公交才能到。博物馆的外表就很可爱，里面有很多特制的道具展示动画里的角色或者场景，还有很多展览介绍工作室作画的场景，最让人心动的是里面有一个小电影院会放映一些不对外公布的动画短片，可惜的是里面的一切都不让拍照。我们在博物馆里游玩了很久，还买了一些纪念品，打算送给朋友。 第五日 东京大学东京大学作为旅行保留项目之一，我一般会去当地最有名的大学看看，刚好品儿有一个高中同学在东大，自然不能错过了。东大作为日剧中经常出线的dream school，如龙樱，在我看来除了建筑漂亮以外，倒没有什么特别的感觉，可能不是日本人，自然没有这种对东大的向往。在食堂吃完午饭后我们就离开了 小石川后乐园偶然发现的公园，据介绍名字取自范仲淹的“后天下之乐而乐”，曾经是私人住宅，有一定的历史了。我们游玩了一段时间，发现这个园子很有中国古典园林的特色，虽然不太出名，但也是一个赏樱的好去处。 千鸟之渊最后一个我们打算去的赏樱之地，总的来说还不错，至少比上野公园强。此外，千鸟渊和皇居很近，可惜的是刚好碰到日本改年号，皇居不开放。 第六日 箱根の旅在日本的最后一天，我们打算去箱根看芦之湖与富士山。","categories":[{"name":"Travel","slug":"Travel","permalink":"http://yoursite.com/categories/Travel/"}],"tags":[{"name":"travel","slug":"travel","permalink":"http://yoursite.com/tags/travel/"},{"name":"Japan","slug":"Japan","permalink":"http://yoursite.com/tags/Japan/"}],"author":"Yuki"},{"title":"初探曼谷","slug":"bangkok-2020-02","date":"2020-08-29T05:51:36.000Z","updated":"2020-08-30T18:01:36.021Z","comments":true,"path":"2020/08/28/bangkok-2020-02/","link":"","permalink":"http://yoursite.com/2020/08/28/bangkok-2020-02/","excerpt":"","text":"为什么去曼谷二月初，国内疫情处于爆发状态，美国突然宣布禁止14天到过中国的外国人进入美国，而我的航班刚好卡在了那天，改签也没有合适的航班，只能选择免签或落地签的第三国中转，备选方案有迪拜、韩国、泰国等。最后考虑种种因素，踏上了去泰国曼谷中转的路。 曼谷夜景，拍自居住的Baiyoke Sky Hotel所在的曼谷摩天大楼Baiyoke Tower 曼谷半月游说是游，倒不如说是避难，考虑到疫情，大部分时间只是待在酒店或者民宿和同学朋友打王者荣耀。唯一一次出游还是和因同在泰国避难而认识的W君包车小转了一下曼谷，我们去了大皇宫，博物馆，一个很出名但我一时想不起名字的市场，只记得外国人和酒吧特别多。因为皇宫不让穿短裤进去，只得现场买了一条泰式裤子 由于当天温度过高，并没有什么特别好的体验，也可能是因为作为一个无神论者，天生对这样的宗教建筑不是特别感兴趣，反而博物馆我们倒是呆了很长时间，一来免去了日晒，二来可以了解泰国几千年来的历史文化积累。 看完博物馆最大的感受就是泰国佛教文化的盛行以及泰国文化受中国文化的巨大影响。 曼谷衣食住行曼谷作为泰国的首都以及世界知名的旅游城市，在衣食住行上也有它的特点和魅力。 最让我怀念的莫过于曼谷的芒果美食，比如芒果糯米饭与随处可见的芒果冰沙，一份80泰铢的价格，对于在湾区生活的我来说简直良心。各种地摊美食也比比皆是，甚至皇宫边上也满是卖各种平价零食饮料的摊贩。不过对于宅在酒店的我来说，最重要的莫过于堪比国内的方便的外卖。东南亚主要使用Grab这个平台来点外卖或者打车，至于外出觅食，则主要使用谷歌地图和大众点评。Grab上面的食物种类倒挺丰盛的，快餐、日料、泰餐、中西餐都有，唯一让我吐槽的点是国际化做的太差，作为一年几千万外国旅客的旅游城市，竟然很多只有泰国菜名，我只得拿出了谷歌翻译的识图功能（不得不说谷歌翻译的这个功能用户体验真差，算了不吐槽自家产品了:)）。总体上来说曼谷的食物还是比较丰富，大部分也符合中国人的饮食习惯，毕竟和日本一样都是以米饭为主食的国家。价格上也不太贵，比北京便宜多了，更不用说和湾区比了。 曼谷的酒店还算住的蛮舒服的，大概300-400一晚的价格就可以在核心地区住的比较舒服了，而同样的价格在北京恐怕只能住廉价快捷酒店了。民宿资源也很丰富，至少远超3年前为了面试Airbnb，特意在北京找airbnb体验的时候。一开始住的是Baiyoke Sky Hotel，但是缺乏洗衣机、微波炉等必要设施，以及为了多体验曼谷不同地区的生活，特意找了一个特别漂亮的民宿，价格也差不多，是在一个高档的小区，host的服务质量也很不错。在房价爆炸的北京和湾区生活的我，习惯性的搜了一下房子的价格，小户型33平方米大概86万人民币，租金大概3300人民币，用作民宿300人民币一天，这收益率和性价比比北京高太多了。高档小区外是成片的类贫民窟建筑 曼谷的出行可以说是一言难尽，如果要赶重要的事情，切记提前很久出发，否则拥挤的交通，随意穿行的突突车会让你崩溃。曼谷的堵主要还是基础设施不行，路窄，规划不好，车又多，估计也没有北京的限号政策。很多小路两边的摊贩也加剧了拥挤程度。作为一个国际旅游城市，司机的英语水平也十分堪忧，基本只能靠比划，好在用App就可以直接设定目的地。不过酒店、餐厅以及一些其他服务业的人员还是会说一些基本的英语的，这点估计还是比北京强，毕竟北京一年国际旅客只有300万左右，而曼谷几乎2300万的国际旅客位列世界第一。此外值得一提的是，曼谷随处可见便利店和药店，简直和东京有得一拼，对于喜欢在便利店觅食的我来说太方便了。 总结这次曼谷的意外之旅还是给了我许多收获，未来有机会的话希望能够再来好好玩耍一次。希望疫情快点过去吧！","categories":[],"tags":[{"name":"travel","slug":"travel","permalink":"http://yoursite.com/tags/travel/"}],"author":"John Smith"},{"title":"8/24 - 8/28 一周炒股小结","slug":"8-24-8-28","date":"2020-08-28T23:40:16.000Z","updated":"2020-08-30T18:38:00.125Z","comments":true,"path":"2020/08/28/8-24-8-28/","link":"","permalink":"http://yoursite.com/2020/08/28/8-24-8-28/","excerpt":"","text":"这周操作不多，主要是把一些炒波动的股票如dropbox，Uber，Tenncent清仓了，换成了可以长期持有的一些股票，如WMT, CVS, BA, JPM等。主要原因1是自己对股票市场的认知还不够成熟，二是决定投入更多心思在工作中，也没有时间来看股票动向。此外还加仓了一些EADSY。因为操作不多，而且清仓的波动股也没有等到它们涨上来，所以最终盈利大概360$左右。值得一提的是，谷歌的股票终于涨上1600了，不过我也没有几股就是了。","categories":[],"tags":[{"name":"stocks","slug":"stocks","permalink":"http://yoursite.com/tags/stocks/"}],"author":"John Smith"}],"categories":[{"name":"Travel","slug":"Travel","permalink":"http://yoursite.com/categories/Travel/"}],"tags":[{"name":"travel","slug":"travel","permalink":"http://yoursite.com/tags/travel/"},{"name":"Japan","slug":"Japan","permalink":"http://yoursite.com/tags/Japan/"},{"name":"stocks","slug":"stocks","permalink":"http://yoursite.com/tags/stocks/"}]}